Revit 2026 API

# FormatOptionsIsValidAccuracy(Double) Method

---

Checks whether an accuracy is valid for the display unit in this FormatOptions.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidAccuracy(
	double accuracy
)
```
```vb
Public Function IsValidAccuracy (
	accuracy As Double
) As Boolean
```
```cpp
public:
bool IsValidAccuracy(
	double accuracy
)
```
```fsharp
member IsValidAccuracy :
        accuracy : float -> bool
```

#### Parameters

accuracy Double
     The accuracy to check.

#### Return Value

Boolean True if the accuracy is valid, false otherwise.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | UseDefault is true in this FormatOptions. |

See the Accuracy property for details on valid accuracy values.

#### Reference

FormatOptions Class

IsValidAccuracy Overload

Autodesk.Revit.DB Namespace